In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

## Indexの階層構造

In [4]:
ser1 = Series(randn(6),index=[list('111222'),list('abcabc')])

In [5]:
ser1

1  a   -1.041821
   b    0.882634
   c    0.167653
2  a    0.865030
   b   -1.418266
   c    0.665759
dtype: float64

In [6]:
ser1.index

MultiIndex(levels=[['1', '2'], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [9]:
ser1['1']

a   -1.041821
b    0.882634
c    0.167653
dtype: float64

In [10]:
ser1['1']['a']

-1.0418214233873704

In [11]:
ser1[:,'a']

1   -1.041821
2    0.865030
dtype: float64

In [12]:
dframe1 = ser1.unstack()

In [13]:
dframe1

          a         b         c
1 -1.041821  0.882634  0.167653
2  0.865030 -1.418266  0.665759

In [15]:
dframe1.unstack()

a  1   -1.041821
   2    0.865030
b  1    0.882634
   2   -1.418266
c  1    0.167653
   2    0.665759
dtype: float64

もとに戻す

In [16]:
dframe1.T.unstack()

1  a   -1.041821
   b    0.882634
   c    0.167653
2  a    0.865030
   b   -1.418266
   c    0.665759
dtype: float64

In [18]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),
                    index=[list('aabb'),list('1234')],
                    columns=[['NY','NY','LA','SA'],['cold','hot','hot','cold']]
                   )

In [19]:
dframe2

      NY      LA   SA
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 3    8   9  10   11
  4   12  13  14   15

In [20]:
dframe2.index.names = ['alp','num']

In [21]:
dframe2

          NY      LA   SA
        cold hot hot cold
alp num
a   1      0   1   2    3
    2      4   5   6    7
b   3      8   9  10   11
    4     12  13  14   15

In [22]:
dframe2.columns.names = ['City','Temp']

In [23]:
dframe2

City      NY      LA   SA
Temp    cold hot hot cold
alp num
a   1      0   1   2    3
    2      4   5   6    7
b   3      8   9  10   11
    4     12  13  14   15

In [25]:
dframe2.swaplevel('City','Temp',axis=1)

Temp    cold hot     cold
City      NY  NY  LA   SA
alp num
a   1      0   1   2    3
    2      4   5   6    7
b   3      8   9  10   11
    4     12  13  14   15

In [26]:
dframe2.sortlevel(1)

/Users/midori/.pyenv/versions/miniconda3-4.3.30/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

City      NY      LA   SA
Temp    cold hot hot cold
alp num
a   1      0   1   2    3
    2      4   5   6    7
b   3      8   9  10   11
    4     12  13  14   15

In [27]:
dframe2.sort_index(level=1)

City      NY      LA   SA
Temp    cold hot hot cold
alp num
a   1      0   1   2    3
    2      4   5   6    7
b   3      8   9  10   11
    4     12  13  14   15

In [29]:
dframe2.sum(level='Temp',axis=1)

Temp     cold  hot
alp num
a   1       3    3
    2      11   11
b   3      19   19
    4      27   27

In [32]:
dframe2.sum(level='alp',axis=0)

City   NY      LA   SA
Temp cold hot hot cold
alp
a       4   6   8   10
b      20  22  24   26